feijie825/TM4C-gonghao/user_h/define.h
/******************** (C) COPYRIGHT 2008 LUMINARY LM3S21xx ********************
;* File Name          : define.h
;* Author             : 张力阵
;* 用户程序声明和预定义
;* 优先级规则 1.主机帧高于从机帧(主机D=0 从机D=1 ID中其他位相同情况下 )
;*            2.标准帧高于扩展帧
;*            3.长数据帧高于短数据帧
*******************************************************************************/
#include "Data_types.h"
#include "TM4C123_Lib.h"

#define CFG_BASE_ADDR 0xFC00                                         //最后一页 用于存放配置字 1K BYTES 大于1K时应增加扇区 最大空间32K BYTES
#define SAVE_TAB_NUMB ((1024 / ((sizeof(SAVE_S) + 3) & 0xFFFC)) - 1) //最多保存条数 4字节对齐 保留1

//CAN 长数据种类个数
#define MSG_OBJ_NUMB 13      //报文对象使用个数  要和LM3S21xx_CAN.C CAN_MSG_SET_TAB 表格长度一帧
#define CAN_LDT_TYPE_NUMB 10 //长数据总类最大个数
#define CAN_LDT_ACT_NUMB 5   //长数据总类实际个数 不大于CAN_LDT_TYPE_NUMB
//CAN ID 参与过滤码定义
#define IDX_MASK_CODE (0x07 << 0)      //帧编号参与过滤代码 3BIT
#define END_MASK_CODE (0x01 << 3)      //结束位参与过滤代码 1BIT
#define TYPE_MSAK_CODE (0x0F << 4)     //类型域参与过滤代码	4BIT
#define MNUM_MASK_CODE (0xff << 8)     //表位域参与过滤代码 8BIT
#define DIR_MASK_CODE (0x01 << 16)     //方向位参与过滤代码 1BIT
#define CMD_MASK_CODE (0x7ff << 17)    //命令域参与过滤代码 11BIT
#define EXD_MASK_CODE (0x01 << 28)     //ID中扩展帧标识符 	1 BIT 为了让标准帧优先级高于扩展帧 增加
#define H6BCMD_MASK_CODE (0x7E0 << 17) //前6位命令域参与过滤代码
//CAN 主机查询和回应状态定义
#define MST_CHK_RCVD 'C'  //已收到主机查询命令
#define SLV_ECHO_SEND 'S' //正在发送从机响应命令
#define SLV_ECHO_ACK 'A'  //从机响应命令成功发送
//从机 CAN长数据发送状态定义
#define SLV_LDATA_TX_NO 0     //从机长数据空闲状态
#define SLV_LDATA_TX_REQ 'R'  //从机长数据发送请求已发出 REQUEST
#define SLV_LDATA_TX_ACK 'A'  //从机长数据发送请求被批准 ACK
#define SLV_LDATA_RETX 'R'    //主机请求从机重发标志 Retransmit
#define SLV_LDATA_TX_IS 'S'   //从机正在发送长数据
#define SLV_LDATA_TX_FI 'F'   //单帧发送完成
#define SLV_LDATA_TX_LAST 'L' //从机正在发送最后一帧数据
#define SLV_LDATA_TX_END 'E'  //从机长数据发送结束
//从机 CAN长数据接收状态定义
#define SLV_LDATA_RX_NO 0    //空闲状态
#define SLV_LDATA_RX_IS 'S'  //从机长数据正在接收状态
#define SLV_LDATA_RX_END 'E' //从机长数据接收结束
#define SLV_LDATA_RX_OUT 'O' //接收到的数据正在处理
//CAN 短帧数据发送状态
#define SLV_SMSG_TX_IS 'S' //正在发送短帧
//串口接收状态定义
#define COM_RX_NO 0    //空闲状态
#define COM_RX_IS 'R'  //串口正在接收数据
#define COM_RX_END 'E' //串口数据接收结束
//串口发送状态定义
#define COM_TX_NO 0   //发送缓冲区空闲状态
#define COM_TX_IS 'O' //串口正在发送数据
#define COM_TX_EN 'E' //串口数据有效
//数据有效定义
#define DATA_YES 'Y'       //存储区有数据标志 表位号
#define DATA_VALIDE 'E'    //数据有效标志
#define DATA_BLANK 'B'     //数据空标志
#define DATA_NOT_BLACK 'N' //数据不空标志

//定义MSG RAM ID对应命令
// 11bit ID 和IDmask 格式 0CDXXXXXXXX 	 C=0~1	 D=0 主->从 D=1 从->主 XXXXXXXX=0~255 表位号
// 29bit ID 和IDmask 格式 1CCCCCCCCCCDXXXXXXXXTTTTEIII	CCCCCCCCCCC =0~2015 D同上 TTTT 长数据 类型 E 长数据结束 III 帧编号
//                         CCCCCCCCCC 命令 D 方向 XXXXXXXX 表位号 TTTT 长数据 类型 E 长数据结束 III 帧编号
//MST 表示主机发送 从机接收 SLV 表示从机发送 主机接收
/**************************************************************
* 帧类型    : 标准帧
* 命令方向  : 主机->从机  D=0
* 表位号    : XXXXXXXX=0 广播        
* 命令功能  : 主机广播查询  
* 参与滤波位:      MM M MMMMMMMM
* 滤波屏蔽  : 开   0C D XXXXXXXX
* 命令格式  :      00 0 00000000 
* 命令优先级: 最高
* 命令号    : 0
* 广播/单播 : 广播
**************************************************************/
#define MST_CHK_BCAST 1 //在MSG RAM 中位置
#define MST_CHK_CMD 0   //主机查询命令编号
/**************************************************************
* 帧类型    : 标准帧
* 命令方向  : 主机->从机  D=0
* 表位号    : XXXXXXXX=本机表号        
* 命令功能  : 主机单播查询  
* 参与滤波位:      MM M MMMMMMMM
* 滤波屏蔽  : 开   0C D XXXXXXXX
* 命令格式  :      00 0 XXXXXXXX 
* 命令优先级: 次高
* 命令号    : 0
* 广播/单播 : 单播
**************************************************************/
#define MST_CHK_SCAST 2
/**************************************************************
* 帧类型    : 标准帧
* 命令方向  : 主机<-从机  D=1
* 表位号    : XXXXXXXX=本机表号        
* 参与滤波位: 发送命令 无需设置滤波     
* 命令功能  : 从机回应主机查询  
* 滤波屏蔽  : 关   0C D XXXXXXXX
* 命令格式  :      00 1 XXXXXXXX 
* 命令优先级: 次高
* 命令号    : 0
* 广播/单播 : 单播
**************************************************************/
#define SLV_CHK_ECHO 3
#define SLV_ECHO_CMD 0 //从机响应命令
/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 主机->从机  D=0
* 表位号    : XXXXXXXX=本机表号        
* 命令功能  : 主机批准从机发送长数据请求  
* 参与滤波位:          MMMMMMMMMMMM M MMMMMMMM			 M	MMM
* 滤波屏蔽  : 开       1CCCCCCCCCCC D XXXXXXXX   TTTT    E  III
* 命令格式  :          100000000000 0 XXXXXXXX 0000~1111 0	000
* 命令优先级: 扩展帧中最高 低于CHK_BCAST CHK_SCAST CHK_ECHO 标准帧
* 命令号    : 0
* 长数据类型: TTTT 0~15
* 长数据结束: E   0 该命令无意义
* 数据编号  : III 0 该命令无意义
* 广播/单播 : 单播(只有单播)
**************************************************************/
#define MST_LDATA_ACK 4
#define MST_LDATA_ACK_CMD 0 //主机批准长数据发送命令
/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 主机->从机  D=0
* 表位号    : XXXXXXXX=0        
* 命令功能  : 主机长广播数据发送 
* 参与滤波位:          MMMMMMMMMMMM M MMMMMMMM
* 滤波屏蔽  : 开       1CCCCCCCCCCC D XXXXXXXX   TTTT    E III
* 命令格式  :          100000000001 0 00000000 0000~1111 X XXX
* 命令优先级: 扩展帧中次高 
* 命令号    : 1
* 长数据类型: TTTT 0~15
* 长数据结束: E   0 长数据发送未结束 1长数据结束(最后一帧)
* 数据编号  : III 0 数据开始 1~7 数据编号 
* 广播/单播 : 广播
**************************************************************/
#define MST_LCDATA_TX 5
#define MST_LDATA_TX_CMD 1 //主机长数据发送命令
/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 主机->从机  D=0
* 表位号    : XXXXXXXX=本机表号        
* 命令功能  : 主机长单播数据发送 
* 参与滤波位:          MMMMMMMMMMMM M MMMMMMMM
* 滤波屏蔽  : 开 	   1CCCCCCCCCCC D XXXXXXXX   TTTT    E III
* 命令格式  :          100000000001 0 XXXXXXXX 0000~1111 X XXX
* 命令优先级: 扩展帧中次高 
* 命令号    : 1
* 长数据类型: TTTT 0~15
* 长数据结束: E   0 长数据发送未结束 1长数据结束(最后一帧)
* 数据编号  : III 0 数据开始 1~7 数据编号 
* 广播/单播 : 单播
**************************************************************/
#define MST_LSDATA_TX 6
/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 主机->从机  D=0
* 表位号    : XXXXXXXX=本机表号        
* 命令功能  : 主机请求从机重发数据 当主机(总控中心)接收长数据块出错时执行
* 参与滤波位:          MMMMMMMMMMMM M MMMMMMMM			 M MMM
* 滤波屏蔽  : 开 	   1CCCCCCCCCCC D XXXXXXXX   TTTT    E III
* 命令格式  :          100000000010 0 XXXXXXXX 0000~1111 0 000
* 命令优先级: 扩展帧中依次 
* 命令号    : 2
* 长数据类型: TTTT 0~15
* 长数据结束: E   0 该命令无意义
* 数据编号  : III 0 该命令无意义
* 广播/单播 : 单播(只有单播)
**************************************************************/
#define MST_LDATA_REQRT 7
#define MST_LDATA_REQRT_CMD 2 //主机请求重发长数据命令
/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 主机->从机  D=0
* 表位号    : XXXXXXXX=0        
* 命令功能  : 主机正在发送短广播数据串
* 参与滤波位:          M            M MMMMMMMM			 M
* 滤波屏蔽  : 开 	   1CCCCCCCCCCC D XXXXXXXX   TTTT    E III
* 命令格式  :          1CCCCCCCCCCC 0 00000000 0000~1111 0 XXX
* 命令优先级: 扩展帧中依次 
* 命令号    : 4~2015 分组 分为7个256条指令组和一个220条指令组 每个指令组对应一个功能单元 
* 长数据类型: TTTT 0~15	 该命令预留
* 长数据结束: E   0      该命令无意义
* 数据编号  : III 0      该命令预留
* 广播/单播 : 广播
**************************************************************/
#define MST_SCDATA_TX 8    //LONG CAST DATA 单播数据串
#define MST_SDATA_TX_CMD 4 //主机发送短数据命令
/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 主机->从机  D=0
* 表位号    : XXXXXXXX=本机表号         
* 命令功能  : 主机正在发送短单播数据串
* 参与滤波位:          M            M MMMMMMMM			 M
* 滤波屏蔽  : 开 	   1CCCCCCCCCCC D XXXXXXXX   TTTT    E III
* 命令格式  :          1CCCCCCCCCCC 0 XXXXXXXX 0000~1111 0 XXX
* 命令优先级: 扩展帧中依次 
* 命令号    : 4~2015 分组 分为7个256条指令组和一个220条指令组 每个指令组对应一个功能单元 
* 长数据类型: TTTT 0~15	 该命令预留
* 长数据结束: E   0      该命令无意义
* 数据编号  : III 0      该命令预留
* 广播/单播 : 单播
**************************************************************/
#define MST_SSDATA_TX 9 //LONG SINGLE DATA 单播数据串

/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 从机-> 主机 D=1
* 表位号    : XXXXXXXX=本机表号        
* 命令功能  : 从机请求向主机发送长数据  
* 参与滤波位: 无
* 滤波屏蔽  : 关	   1CCCCCCCCCCC D XXXXXXXX   TTTT    E III
* 命令格式  :          100000000000 1 XXXXXXXX 0000~1111 0 000
* 命令优先级: 扩展帧中最高 低于CHK_BCAST CHK_SCAST CHK_ECHO 标准帧 
* 命令号    : 0
* 长数据类型: TTTT 0~15
* 长数据结束: E   0 该命令无意义
* 数据编号  : III 0 该命令无意义
* 广播/单播 : 单播(只有单播)
**************************************************************/
#define SLV_LDATA_REQTX 10
/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 从机-> 主机 D=1
* 表位号    : XXXXXXXX=本机表号        
* 命令功能  : 从机长数据发送 
* 参与滤波位: 无         
* 滤波屏蔽  : 关 	   1CCCCCCCCCCC D XXXXXXXX   TTTT    E III
* 命令格式  :          100000000001 1 XXXXXXXX 0000~1111 X XXX
* 命令优先级: 扩展帧中次高 
* 命令号    : 1
* 长数据类型: TTTT 0~15
* 长数据结束: E   0 长数据发送未结束 1长数据结束(最后一帧)
* 数据编号  : III 0 数据开始 1~7 数据编号 
* 广播/单播 : 单播(只有单播)
**************************************************************/
#define SLV_LDATA_TX 11
/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 从机-> 主机 D=1
* 表位号    : XXXXXXXX=本机表号        
* 命令功能  : 从机请求主机重发数据 当从机接收长数据块出错时执行 
* 参与滤波位: 无         
* 滤波屏蔽  : 关 	   1CCCCCCCCCCC D XXXXXXXX   TTTT    E III
* 命令格式  :          100000000010 1 XXXXXXXX 0000~1111 0 000
* 命令优先级: 扩展帧中次高 
* 命令号    : 2
* 长数据类型: TTTT 0~15
* 长数据结束: E   0 该命令无意义
* 数据编号  : III 0 该命令无意义
* 广播/单播 : 单播(只有单播)
**************************************************************/
#define SLV_LDATA_REQRT 12
/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 从机->主机  D=1
* 表位号    : XXXXXXXX=本机表号         
* 命令功能  : 从机正在发送短数据串
* 参与滤波位: 无
* 滤波屏蔽  : 关 	   1CCCCCCCCCCC D XXXXXXXX   TTTT    E III
* 命令格式  :          1CCCCCCCCCCC 1 XXXXXXXX 0000~1111 X XXX
* 命令优先级: 扩展帧中依次 
* 命令号    : 4~2015 分组 分为7个256条指令组和一个220条指令组 每个指令组对应一个功能单元 
* 长数据类型: TTTT 0~15	 该命令预留
* 长数据结束: E   0      该命令无意义
* 数据编号  : III 0      该命令预留
* 广播/单播 : 单播(只有单播)
**************************************************************/
#define SLV_SDATA_TX 13 //SHORT  DATA 短数据串

//定义CAN1 MSG RAM ID对应命令
// 29bit ID 和IDmask 格式 1DCCCCCCCCCCXXXXXXXXDDDDDDDD	CCCCCCCCCCC =0~1983 D DDDDDDDD 设备类型号
//                         D 方向 CCCCCCCCCC 命令  XXXXXXXX 表位号
//MST 表示主机发送 从机接收 SLV 表示从机发送 主机接收
/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 主机->从机  R=0
* 设备类型号: DDDDDDDD 电机单元 1 功耗单元 2
* 表位号    : XXXXXXXX=0        
* 命令功能  : 主机正在发送短广播数据串
* 参与滤波位:          MM             MMMMMMMM  DDDDDDDD               
* 滤波屏蔽  : 开       1DCCCCCCCCCCC  XXXXXXXX  11111111              
* 命令格式  :          10CCCCCCCCCCC  00000000  00000002              
* 命令优先级: 扩展帧中依次 
* 命令号    : 0~1983 
* 广播/单播 : 广播
**************************************************************/
#define CAN1_MST_SCDATA_TX 1 //广播数据串
/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 主机->从机  R=0
* 设备类型号: DDDDDDDD 电机单元 1 功耗单元 2
* 表位号    : XXXXXXXX=本机表号         
* 命令功能  : 主机正在发送短单播数据串
* 参与滤波位:          MM             MMMMMMMM DDDDDDDD
* 滤波屏蔽  : 开       1R CCCCCCCCCCC XXXXXXXX 11111111
* 命令格式  :          10 CCCCCCCCCCC XXXXXXXX 00000002
* 命令优先级: 扩展帧中依次 
* 命令号    : 0~1983 
* 广播/单播 : 单播
**************************************************************/
#define CAN1_MST_SSDATA_TX 2 //单播数据串

/**************************************************************
* 帧类型    : 扩展帧
* 命令方向  : 从机->主机  D=1
* 表位号    : XXXXXXXX=本机表号         
* 命令功能  : 从机正在发送短数据串
* 参与滤波位: 无
* 滤波屏蔽  : 关 	   1CCCCCCCCCCC D XXXXXXXX   TTTT    E III
* 命令格式  :        1CCCCCCCCCCC 1 XXXXXXXX 0000~1111 X XXX
* 命令优先级: 扩展帧中依次 
* 命令号    : 4~2015 分组 分为7个256条指令组和一个220条指令组 每个指令组对应一个功能单元 
* 长数据类型: TTTT 0~15	 该命令预留
* 长数据结束: E   0      该命令无意义
* 数据编号  : III 0      该命令预留
* 广播/单播 : 单播(只有单播)
**************************************************************/
#define CAN1_SLV_SDATA_TX 3 //SHORT  DATA 短数据串
//定义SSI位速率
#define SSI_BITRATE 16667 //16.667K

