feijie825/TM4C-gonghao/user_h/define.h
#define NATIONAL 'N' //国网表
#define SOUTH 'S'    //南网表
#define Enable_Bit 1
#define Disable_Bit 0
#define LEVEL_MOD 0
#define PULSE_MOD 1
#define LOW_PUS_TRG 0
#define HIG_PUS_TRG 1

#define MTR_NO '0'  //没表
#define MTR_RDY '1' //表放好

#define LGT_OFF '0' //灯灭
#define YLW_ON '1'  //黄灯亮
#define GRN_ON '2'  //绿灯亮
#define RED_ON '3'  //红灯亮

#define LED_6 '6' //6位数码管
#define LED_8 '8' //8位数码管

//数据有效定义
#define YES 'Y'       //存储区有数据标志 表位号
#define VALIDE 'E'    //数据有效标志
#define BLANK 'B'     //数据空标志
#define NOT_BLACK 'N' //数据不空标志

#define LED_6 '6' //六位数码管
#define LED_8 '8' //八位数码管

#define UART_NUMB 5 //串口个数
//误差计算单元多功能端口
#define MTRCOM 0 //模拟表(多功能表)端口
#define LCTCOM 1 //负控终端端口
#define RTECOM 2 //负控终端RS485维护口
#define ATECOM 3 //负控终端RS232维护口
#define IRECOM 4 //红外头通讯口
//波特率定义 数据位
#define UART_5_BIT 0 //数据位长度 5bit
#define UART_6_BIT 1 //数据位长度 6bit
#define UART_7_BIT 2 //数据位长度 7bit
#define UART_8_BIT 3 //数据位长度 8bit
//波特率定义 停止位
#define UART_1_STOP 0 //1   stop bit
#define UART_2_STOP 1 //2   stop bit
//波特率定义 校验位
#define UART_N_PARITY 0 //无校验位
#define UART_O_PARITY 1 //ODD 奇校验
#define UART_E_PARITY 2 //EVEN 偶校验
#define UART_M_PARITY 3 //Mark 校验(1)
#define UART_S_PARITY 4 //Space校验(0)

#define UART0_BAUD 2400 //UART0默认波特率
#define UART1_BAUD 2400 //UART1默认波特率
#define UART3_BAUD 2400 //UART3默认波特率
#define UART5_BAUD 2400 //UART5默认波特率
#define UART6_BAUD 2400 //UART6默认波特率

#define MIN_BAUD 110    //最小波特率
#define MAX_BAUD 115200 //最大波特率

#define Wh_Wire '0'  //有功接线
#define Var_Wire '1' //无功接线

#define VLOSS_1 '1' //ΔU=100% 1S3次    与原装置协议相同
#define VLOSS_2 '2' //ΔU=100% 1个周期
#define VLOSS_3 '3' //ΔU=50%  1分钟

#define GB '1'  //挂表             与原装置协议不同
#define BGB '2' //不挂表

#define GD_E '1' //共发射集
#define GD_C '2' //共集电极

#define HC_2 '1' //合成两路
#define HC_3 '2' //合成三路
#define HC_4 '3' //合成四路

#define GDT_PLS '1' //光电头脉冲
#define DZ_PLS '2'  //电子脉冲
#define SZ_PLS '3'  //时钟脉冲
#define XUL_PLS '4' //需量脉冲
#define TQ_PLS '5'  //投切脉冲
#define HZ_PLS '6'  //合闸脉冲

#define EPLS_T '1' //测量电能脉冲周期
#define SZ_T '2'   //测量时钟脉冲周期
#define XUL_T '3'  //测量需量脉冲周期
#define TQ_T '4'   //投切脉冲
#define HZ_T '5'   //合闸脉冲

#define UNION_PLS '1' //联合多功能脉冲 时钟 需量 投切 等共用
#define ALONE_PLS '2' //独立多功能脉冲 时钟 需量 投切 分开输入
//只有在联合脉冲下有效
#define NO_PLS '0'     //默认无脉冲输入
#define SZCLK_PLS '1'  //当前输入为时钟脉冲
#define XULCLK_PLS '2' //当前输入为需量脉冲
#define TQCLK_PLS '3'  //当前输入为投切脉冲

#define PA_PLS '0' //正向有功
#define QA_PLS '1' //正向无功
#define PR_PLS '2' //反向有功
#define QR_PLS '3' //反向无功

#define NCATCH_HB '0' //黑斑未捕捉
#define CATCH_HB '1'  //黑斑已捕捉

#define ZZ_STRT '0' //走字开始
#define ZZ_END '1'  //走字结束

#define NY_BAD '0'  //耐压击穿
#define NY_GOOD '1' //耐压合格
#define NY_UNKW '2' //未知

#define MEA_STOP '0'  //停止测量
#define MEA_ORDER '1' //正常工作

#define UA_PHASE (1 << 0)                          //A相电压
#define UB_PHASE (1 << 1)                          //B相电压
#define UC_PHASE (1 << 2)                          //C相电压
#define ALL_PHASE (UA_PHASE | UB_PHASE | UC_PHASE) //三相电压

#define OFF 0 //断开
#define ON 1  //接入

#define DISP_TEST '0'  //显示试验状态
#define DISP_CFREQ '1' //显示时钟频率
#define DISP_CERR '2'  //显示日计时误差
#define DISP_XULT '3'  //显示需量周期
#define DISP_TQMC '4'  //显示投切脉冲

#define SUB_485 '1' //表第二485通道
#define RED_485 '2' //表红外485

#define MTR_UOP '0'  //表位电压断开
#define MTR_UCL '1'  //表位继电器控制电压吸合
#define MTR_UECL '2' //表位电子开关控制电压吸合

#define SINGLE 0 //单相台
#define THREE 1  //三相台
//接线方式定义
#define WIRE_P1 '0'    //接线方式 单相有功
#define WIRE_P4 '1'    //接线方式 三相四线有功
#define WIRE_P3_2 '2'  //接线方式 三相三线有功
#define WIRE_Q4_3 '3'  //接线方式 三相四线无功90度三元件无功
#define WIRE_Q3_60 '4' //接线方式 三相三线移相60度无功 60度两元件无功
#define WIRE_Q3_90 '5' //接线方式 三相三线跨线无功90度两元件无功
#define WIRE_Q4_R '6'  //接线方式 三相四线真无功
#define WIRE_Q3_R '7'  //接线方式 三相三线真无功
#define WIRE_P3_3 '8'  //接线方式 三相三线有功 UA UB UC 按三相四线输出UB对地不为0
#define WIRE_Q3_2 '9'  //接线方式 三相三线无功 输出按三相三线输出 UB接U0
#define WIRE_Q3_CT ':' //接线方式 三相三线人工中心点无功
#define WIRE_Q1 ';'    //单相方式 无功

#define MEA_PWR_P3 0 //测功耗 P3
#define MEA_PWR_P4 1 //测功耗 P4
//定义CAN命令表
#define MULTI_DATA_CMD 0   //0-3     长数据帧命令   4条
#define MTR_DATA_CMD 4     //4-259   原误差单元命令 256条
#define CLOCK_DATA_CMD 260 //260-515	时钟校验仪命令 256条
#define FKZD_DATA_CMD 516  //516-771 负控终端命令   256条
                           //772-2015 1244条指令预留
#define MTR_TAB_NUMB 128

#define WATCH_TIME 400 //1000    //看门狗周期单位:mS 毫秒
#define SYS_TIME 1000  //系统节拍定时周期 单位:uS 微秒

#define CAN_TX_OVTM 5000     //CAN发送超时5S
#define CAN_RX_OVTM 12000    //CAN接收超时18S
#define NY_SEND_TIME 2000    //命令发送定时
#define ZK2009_OVTM 10000    //ZK2009启动超时
#define CAN_LDATA_SERR_MAX 3 //CAN长数据最大发送错误计数 超过该计数值 清除有数据标志 可以接收下一帧

#define TIMER_8MS 8
#define NY_CHK_TIME (200 / TIMER_8MS)  //耐压检测定时
#define GDT_RST_TIME (200 / TIMER_8MS) //光电头复位延时 单位:ms
#ifdef PULSE
#define GDT_REN_TIME (400 / TIMER_8MS) //光电脉冲中断重新使能定时 400ms
#define DZ_REEN_TIME (400 / TIMER_8MS) //电子脉冲中断重新使能定时 400ms
#else
#define GDT_REN_TIME (40 / TIMER_8MS) //光电脉冲中断重新使能定时 40ms
#define DZ_REEN_TIME (40 / TIMER_8MS) //电子脉冲中断重新使能定时 40ms
#endif
#define SZ_REEN_TIME (40 / TIMER_8MS)  //时钟脉冲中断重新使能定时 200ms
#define XUL_REEN_TIME (40 / TIMER_8MS) //需量脉冲中断重新使能定时 200ms
#define TQ_REEN_TIME (40 / TIMER_8MS)  //投切脉冲中断重新使能定时 200ms
#define HZ_REEN_TIME (40 / TIMER_8MS)  //合闸脉冲中断重新使能定时 200ms

#define GDT_PLS_TIME 20  //光电脉冲消抖延时
#define DZ_PLS_TIME 20   //电子脉冲消抖延时
#define SZ_PLS_TIME 20   //时钟脉冲消抖延时
#define NZTZ_PLS_TIME 20 //开路信号消抖延时

#define KEY_REEN_TIME (200 / TIMER_8MS) //按键重启使能中断定时
#define KEY_PLUG_TIME (600 / TIMER_8MS) //按键挂表定时
#define PLL_CHK_TIME (200 / TIMER_8MS)  //锁相环PLL检查定时

#define MBJ_SEND_TIME 21000  //表报警回送定时
#define WZTZ_SEND_TIME 19000 //表跳闸回送定时
#define NZTZ_SEND_TIME 5000  //外置跳闸回送定时
#define MTR_ON_TIME 10000    //表位放好定时
#define GZ_SEND_TIME 3000    //定时回送故障
#define GZ_STB_TIME 1500     //故障稳定定时
#define HC165_TIME 20        //HC165采样定时
#define LUNCI1_SEND_TIME 100 //轮次1信息回送定时
#define LUNCI2_SEND_TIME 150 //轮次2信息回送定时
#define LUNCI3_SEND_TIME 200 //轮次3信息回送定时
#define LUNCI4_SEND_TIME 250 //轮次4信息回送定时
//#define CD4094_TIME           20               //CD4094延时处理

#define DISP_EN_TIME 15 //显示使能定时

#define POWER_UP_TIME 4000 //上电定时 上电稳定

#define STD_CLK_FREQ 500000 //标准时钟频率
//标准时钟脉冲计数器理论中断时间=0xFFFF*1000/STD_CLK_FREQ=131ms
#define STD_CLK_OVTM (1000 / 8) //单位:8ms 约1s
#define STD_ECLK_OVTM 20000     //单位:1ms 约20s

