feijie825/TM4C-gonghao/user_h/define.h
#define BACK_MEA_ERR_D '0' //回误差校验状态
#define CATCH_HB_FWEG '1'  //前沿对斑 ForWard  EDGE
#define CATCH_HB_BWEG '2'  //后沿对斑 BackWard EDGE

#define BEEP_ONN '1' //喇叭开
//口编号定义

#define SSI0 SSI0_BASE // SSI0
#define SSI1 SSI1_BASE // SSI1
#define SSI2 SSI2_BASE // SSI2
#define SSI3 SSI3_BASE // SSI3

#define WATCHDOG0 WATCHDOG0_BASE // Watchdog0
#define WATCHDOG1 WATCHDOG1_BASE // Watchdog1

#define CAN0 CAN0_BASE // CAN0  地址
#define CAN1 CAN1_BASE // CAN1  地址

#define UART0 UART0_BASE // UART0 地址
#define UART1 UART1_BASE // UART1 地址
#define UART2 UART2_BASE // UART2 地址
#define UART3 UART3_BASE // UART3 地址
#define UART4 UART4_BASE // UART4 地址
#define UART5 UART5_BASE // UART5 地址
#define UART6 UART6_BASE // UART6 地址
#define UART7 UART7_BASE // UART7 地址

#define TIMER0 TIMER0_BASE // Timer0
#define TIMER1 TIMER1_BASE // Timer1
#define TIMER2 TIMER2_BASE // Timer2
#define TIMER3 TIMER3_BASE // Timer3
#define TIMER4 TIMER4_BASE // Timer4
#define TIMER5 TIMER5_BASE // Timer5

#define PORTA 0  //PORTA 口编号定义
#define PORTB 1  //PORTB 口编号定义
#define PORTC 2  //PORTC 口编号定义
#define PORTD 3  //PORTD 口编号定义
#define PORTE 4  //PORTE 口编号定义
#define PORTF 5  //PORTF 口编号定义
#define PORTG 6  //PORTG 口编号定义
#define PORTH 7  //PORTH 口编号定义
#define PORTJ 8  //PORTJ 口编号定义
#define PORTK 9  //PORTK 口编号定义
#define PORTL 10 //PORTL 口编号定义
#define PORTM 11 //PORTM 口编号定义
#define PORTN 12 //PORTN 口编号定义
#define PORTP 13 //PORTP 口编号定义

#define GPIOA GPIO_PORTA_BASE //PORTA 口地址定义
#define GPIOB GPIO_PORTB_BASE //PORTB 口地址定义
#define GPIOC GPIO_PORTC_BASE //PORTC 口地址定义
#define GPIOD GPIO_PORTD_BASE //PORTD 口地址定义
#define GPIOE GPIO_PORTE_BASE //PORTE 口地址定义
#define GPIOF GPIO_PORTF_BASE //PORTF 口地址定义
#define GPIOG GPIO_PORTG_BASE //PORTG 口地址定义
#define GPIOH GPIO_PORTH_BASE //PORTH 口地址定义
#define GPIOJ GPIO_PORTJ_BASE //PORTJ 口地址定义
#define GPIOK GPIO_PORTK_BASE //PORTK 口地址定义
#define GPIOL GPIO_PORTL_BASE //PORTL 口地址定义
#define GPIOM GPIO_PORTM_BASE //PORTM 口地址定义
#define GPION GPIO_PORTN_BASE //PORTN 口地址定义
#define GPIOP GPIO_PORTP_BASE //PORTP 口地址定义

//DEFINE 管道对应端口
//GPIOA
#define UART0_GPIO GPIOA
#define SPI0_GPIO GPIOA
#define DISP_RST_GPIO GPIOA
#define KEY_IN_GPIO GPIOA

//GPIOB
#define YK1NO_GPIO GPIOB //遥控信号1常开
#define YK1NC_GPIO GPIOB //遥控信号1常闭
#define YK2NO_GPIO GPIOB //遥控信号2常开
#define YK2NC_GPIO GPIOB //遥控信号2常闭
#define I2C0_SCL_GPIO GPIOB
#define I2C0_SDA_GPIO GPIOB
#define I2C0_WP_GPIO GPIOB
// #define CAN0_GPIO             GPIOB    //CAN0
//GPIOC
#define JTAG_GPIO GPIOC  //调试JTAG/SWD
#define UART1_GPIO GPIOC //UART1
#define UART3_GPIO GPIOC //UART3
//GPIOD
#define UART6_GPIO GPIOD //UART6
/*TM4C_GH*/
#define U_5460A_SCLK_GPIO GPIOD //电压回路5460SCLK
#define U_5460A_CS_GPIO GPIOD   //电压回路5460CS
#define U_5460A_SDO_GPIO GPIOD  //电压回路5460SDO
#define U_5460A_SDI_GPIO GPIOD  //电压回路5460SDI

//GPIOE
#define UART7_GPIO GPIOE //UART7
#define TZ_ZS_GPIO GPIOE //跳闸指示灯控制
#define AIN0_GPIO GPIOE  //AD0转换引脚
#define UART5_GPIO GPIOE //UART5
#define CAN1_GPIO GPIOE  //CAN1
/*TM4C_GH*/
#define U_5460A_RST_GPIO GPIOE //电压回路5460RST

//GPIOF
#define UC_ESWC_GPIO GPIOF   //C相电压电子开关控制 三相台定义  UC_ESWC
#define UA_ESWC_GPIO GPIOF   //A相电压电子开关控制 三相台定义  UA_ESWC
#define UB_ESWC_GPIO GPIOF   //B相电压电子开关控制 三相台定义  UB_ESWC
#define GBC_C_GPIO GPIOF     //C相续流继电器断开控制
#define TEST_LAMP_GPIO GPIOF //装置校验指示灯控制
#define UC_JC_GPIO GPIOF     //C相电压继电器控制   三相台定义  UC_JC
#define UB_JC_GPIO GPIOF     //B相电压继电器控制   三相台定义 UB_JC   U2K_C	单相控制零线
#define UA_JC_GPIO GPIOF     //A相电压继电器控制   三相台定义 UA_JC   U1K_C	单相控制火线
/*TM4C_GH*/
#define CAN0_GPIO GPIOF //CAN0

//GPIOG
#define BW_GPIO GPIOG      //表位号
#define MC_OUT_GPIO GPIOG  //专变终端(2013版)脉冲输出
#define MC_OUT1_GPIO GPIOG //专变终端Ⅲ型(2013版)脉冲输出1
#define MC_OUT2_GPIO GPIOG //专变终端Ⅲ型(2013版)脉冲输出2
#define MC_OUT3_GPIO GPIOG //专变终端Ⅲ型(2013版)脉冲输出3
#define MC_OUT4_GPIO GPIOG //专变终端Ⅲ型(2013版)脉冲输出4
#define MC_OUT5_GPIO GPIOG //专变终端Ⅲ型(2013版)脉冲输出5
#define MC_OUT6_GPIO GPIOG //专变终端Ⅲ型(2013版)脉冲输出6
#define MC_OUT7_GPIO GPIOG //专变终端Ⅲ型(2013版)脉冲输出7
#define MC_OUT8_GPIO GPIOG //专变终端Ⅲ型(2013版)脉冲输出8
//PORTH
#define ABBA_GPIO GPIOH         //
#define I_5460A_INT_GPIO GPIOH  //电流回路5460INT
#define I_5460A_SCLK_GPIO GPIOH //电流回路5460SCLK
#define I_5460A_CS_GPIO GPIOH   //电流回路5460CS
#define I_5460A_SDO_GPIO GPIOH  //电流回路5460SDO
#define I_5460A_SDI_GPIO GPIOH  //电流回路5460SDI

//PORTJ
#define YX_CTL_GPIO GPIOJ  //专变终端(2013版)遥信控制端口
#define YX_CTL1_GPIO GPIOJ //专变终端(2013版)遥信控制端口1
#define YX_CTL2_GPIO GPIOJ //专变终端(2013版)遥信控制端口2
#define YX_CTL3_GPIO GPIOJ //专变终端(2013版)遥信控制端口3
#define YX_CTL4_GPIO GPIOJ //专变终端(2013版)遥信控制端口4
#define YX_CTL5_GPIO GPIOJ //专变终端(2013版)遥信控制端口5
#define YX_CTL6_GPIO GPIOJ //专变终端(2013版)遥信控制端口6
#define YX_CTL7_GPIO GPIOJ //专变终端(2013版)遥信控制端口7
#define YX_CTL8_GPIO GPIOJ //专变终端(2013版)遥信控制端口8
/*TM4C_GH*/
#define NO_SELT3_GPIO GPIOJ
#define P3P4SELOUT3_GPIO GPIOJ
#define NO_SELT2_GPIO GPIOJ
#define P3P4SELOUT2_GPIO GPIOJ
#define NO_SELT1_GPIO GPIOJ
#define P3P4SELOUT1_GPIO GPIOJ
#define K2_GPIO GPIOJ
#define K1_GPIO GPIOJ

//PORTK
#define YK4NO_GPIO GPIOK //遥控信号4常开
#define YK4NC_GPIO GPIOK //遥控信号4常闭
#define YK3NO_GPIO GPIOK //遥控信号3常开
#define YK3NC_GPIO GPIOK //遥控信号3常闭

//PORTL
#define HFIN1_GPIO GPIOL  //备用高频信号输入端口1 Timer0-A
#define HFIN2_GPIO GPIOL  //备用高频信号输入端口2 Timer0-B
#define HFIN3_GPIO GPIOL  //备用高频信号输入端口3 Timer1-A
#define FH_IN_GPIO GPIOL  //标准表高频输入 Timer1-B
#define JZ_IN_GPIO GPIOL  //高稳晶振输入接口 Timer1-B
#define QFH_IN_GPIO GPIOL //标准表无功高频脉冲 Timer2-B，谐波标准表预留
#define WGFMC_GPIO GPIOL  //被检表反向无功脉冲 Timer3-A
#define YGFMC_GPIO GPIOL  //被检表反向有功脉冲 Timer3-B

//PORTM
#define WGMC_GPIO GPIOM    //被检表正向无功脉冲 Timer4-A
#define SZ_MC_GPIO GPIOM   //被检表时钟脉冲 Timer4-B
#define YGMC_GPIO GPIOM    //被检表正向有功脉冲 Timer5-A
#define GDT_MC_GPIO GPIOM  //被检表光电头脉冲 Timer5-B
#define GDT_RST_GPIO GPIOM //光电头复位控制引脚
#define XL_MC_GPIO GPIOM   //被检表需量周期输入
#define TQ_MC_GPIO GPIOM   //被检表时段投切脉冲
#define GOG_KZ_GPIO GPIOM  //被检表脉冲共高共低选择控制

//PORTN
#define TTAB1_GPIO GPION   //双回路切换1
#define TTAB2_GPIO GPION   //双回路切换2
#define WDI_GPIO GPION     //外置看门狗控制引脚
#define OPEN_IN_GPIO GPION //续流保护继电器状态输入引脚
#define BGB_C_GPIO GPION   //三相续流继电器闭合控制
#define GBA_C_GPIO GPION   //A相续流继电器断开控制
#define GBB_C_GPIO GPION   //B相续流继电器断开控制
/*TM4C_GH*/
#define I_5460A_RST_GPIO GPION //电流回路5460RST
//PORTP
#define DOOR_GPIO GPIOP   //门控信号输出
#define BJ_SIG_GPIO GPIOP //报警信号输入
/*TM4C_GH*/
#define U_5460A_INT_GPIO GPIOP //电压回路5460INT

//管脚定义
//PORTA
#define U0RX GPIO_PIN_0     //UART0接收
#define U0TX GPIO_PIN_1     //UART0发送
#define SSICLK GPIO_PIN_2   //SSICLK HD7279 时钟
#define SSIFSS GPIO_PIN_3   //SSIFSS HD7279 片选
#define SSIRX GPIO_PIN_4    //SSIRX  HD7279 发送
#define SSITX GPIO_PIN_5    //SSITX  HD7279 接收
#define DISP_RST GPIO_PIN_6 //       HD7279 复位
#define KEY_IN GPIO_PIN_7   //按键输入

//PORTB
#define YK1NO GPIO_PIN_0 //遥控信号1常开
#define YK1NC GPIO_PIN_1 //遥控信号1常闭
#define YK2NO GPIO_PIN_2 //遥控信号2常开
#define YK2NC GPIO_PIN_3 //遥控信号2常闭
// #define CAN0RX                GPIO_PIN_4   //CAN0接收
// #define CAN0TX                GPIO_PIN_5   //CAN0发送
/*TM4C_GH*/
#define I2C0_WP GPIO_PIN_1
#define I2C0_SCL GPIO_PIN_2
#define I2C0_SDA GPIO_PIN_3

