feijie825/TM4C-gonghao/user_h/define.h
//PORTC
#define TCK GPIO_PIN_0  //调试TCK SWCLK SW调试
#define TMS GPIO_PIN_1  //调试TMS SWDIO SW调试
#define TDI GPIO_PIN_2  //调试TDI
#define TDO GPIO_PIN_3  //调试TDO SWO   SW调试
#define U1RX GPIO_PIN_4 //UART1接收
#define U1TX GPIO_PIN_5 //UART1发送
#define U3RX GPIO_PIN_6 //UART3接收
#define U3TX GPIO_PIN_7 //UART3发送
//PORTD
#define U_5460A_SCLK GPIO_PIN_0 //电压回路5460SCLK
#define U_5460A_CS GPIO_PIN_1   //电压回路5460CS
#define U_5460A_SDO GPIO_PIN_2  //电压回路5460SDO
#define U_5460A_SDI GPIO_PIN_3  //电压回路5460SDI
#define U6RX GPIO_PIN_4         //UART6接收
#define U6TX GPIO_PIN_5         //UART6发送

//单相台定义
#define ION_JC GPIO_PIN_1  //电流继电器通 单相台用 UB电压继电器控制信号
#define IOFF_JC GPIO_PIN_2 //电流继电器断 单相台用 UC电压继电器控制信号

//PORTE
#define U7RX GPIO_PIN_0   //UART7接收
#define U7TX GPIO_PIN_1   //UART7发送
#define TZ_ZS GPIO_PIN_2  //跳闸指示灯控制引脚
#define AIN0 GPIO_PIN_3   //AD0转换引脚
#define U5RX GPIO_PIN_4   //UART5接收
#define U5TX GPIO_PIN_5   //UART5发送
#define CAN1RX GPIO_PIN_6 //CAN1接收
#define CAN1TX GPIO_PIN_7 //CAN1发
/*TM4C_GH*/
#define U_5460A_RST GPIO_PIN_3 //电压回路5460RST

//PORTF
#define UC_ESWC GPIO_PIN_0   //C相电压电子开关控制 三相台定义  UC_ESWC
#define UA_ESWC GPIO_PIN_1   //A相电压电子开关控制 三相台定义  UA_ESWC
#define UB_ESWC GPIO_PIN_2   //B相电压电子开关控制 三相台定义  UB_ESWC
#define GBC_C GPIO_PIN_3     //C相续流继电器断开控制引脚
#define TEST_LAMP GPIO_PIN_4 //校验指示灯控制引脚
#define UC_JC GPIO_PIN_5     //C相电压继电器控制   三相台定义 UC_JC   U3K_C
#define UB_JC GPIO_PIN_6     //B相电压继电器控制   三相台定义 UB_JC   U2K_C	单相控制零线
#define UA_JC GPIO_PIN_7     //A相电压继电器控制   三相台定义 UA_JC   U1K_C	单相控制火线
/*TM4C_GH*/
#define CAN0RX GPIO_PIN_0 //CAN0接收
#define CAN0TX GPIO_PIN_3 //CAN0发送

//PORTG
#define BW (GPIO_PIN_0 | GPIO_PIN_1 | \
            GPIO_PIN_2 | GPIO_PIN_3 | \
            GPIO_PIN_4 | GPIO_PIN_5 | \
            GPIO_PIN_6 | GPIO_PIN_7)
#define MC_OUT (GPIO_PIN_0 | GPIO_PIN_1 | \
                GPIO_PIN_2 | GPIO_PIN_3 | \
                GPIO_PIN_4 | GPIO_PIN_5 | \
                GPIO_PIN_6 | GPIO_PIN_7)
#define MC_OUT1 GPIO_PIN_0 //脉冲输出1
#define MC_OUT2 GPIO_PIN_1 //脉冲输出2
#define MC_OUT3 GPIO_PIN_2 //脉冲输出3
#define MC_OUT4 GPIO_PIN_3 //脉冲输出4
#define MC_OUT5 GPIO_PIN_4 //脉冲输出5
#define MC_OUT6 GPIO_PIN_5 //脉冲输出6
#define MC_OUT7 GPIO_PIN_6 //脉冲输出7
#define MC_OUT8 GPIO_PIN_7 //脉冲输出8
//PORTH
#define ABBA GPIO_PIN_0 //RS485极性翻转控制引脚
/*TM4C_GH*/
#define I_5460A_INT GPIO_PIN_3  //电流回路5460INT
#define I_5460A_SCLK GPIO_PIN_4 //电流回路5460SCLK
#define I_5460A_CS GPIO_PIN_5   //电流回路5460CS
#define I_5460A_SDO GPIO_PIN_6  //电流回路5460SDO
#define I_5460A_SDI GPIO_PIN_7  //电流回路5460SDI

//PORTJ
#define YX_CTL (GPIO_PIN_0 | GPIO_PIN_1 | \
                GPIO_PIN_2 | GPIO_PIN_3 | \
                GPIO_PIN_4 | GPIO_PIN_5 | \
                GPIO_PIN_6 | GPIO_PIN_7)
#define YX_CTL1 GPIO_PIN_0 //专变终端(2013版)遥信控制端口1
#define YX_CTL2 GPIO_PIN_1 //专变终端(2013版)遥信控制端口2
#define YX_CTL3 GPIO_PIN_2 //专变终端(2013版)遥信控制端口3
#define YX_CTL4 GPIO_PIN_3 //专变终端(2013版)遥信控制端口4
#define YX_CTL5 GPIO_PIN_4 //专变终端(2013版)遥信控制端口5
#define YX_CTL6 GPIO_PIN_5 //专变终端(2013版)遥信控制端口6
#define YX_CTL7 GPIO_PIN_6 //专变终端(2013版)遥信控制端口7
#define YX_CTL8 GPIO_PIN_7 //专变终端(2013版)遥信控制端口8
/*TM4C_GH*/
#define NO_SELT3 GPIO_PIN_0
#define P3P4SELOUT3 GPIO_PIN_1
#define NO_SELT2 GPIO_PIN_2
#define P3P4SELOUT2 GPIO_PIN_3
#define NO_SELT1 GPIO_PIN_4
#define P3P4SELOUT1 GPIO_PIN_5
#define K2 GPIO_PIN_6
#define K1 GPIO_PIN_7

//PORTK
#define YK4NO GPIO_PIN_4 //遥控信号4常开
#define YK4NC GPIO_PIN_5 //遥控信号5常闭
#define YK3NC GPIO_PIN_6 //遥控信号6常闭
#define YK3NO GPIO_PIN_7 //遥控信号7常开

//PORTL
#define HFIN1 GPIO_PIN_0  //备用高频信号输入端口1 Timer0-A
#define HFIN2 GPIO_PIN_1  //备用高频信号输入端口2 Timer0-B
#define HFIN3 GPIO_PIN_2  //备用高频信号输入端口3 Timer1-A
#define FH_IN GPIO_PIN_3  //标准表有功高频输入 Timer1-B
#define JZ_IN GPIO_PIN_4  //高稳晶振输入接口 Timer2-A
#define QFH_IN GPIO_PIN_5 //标准表无功高频输入 Timer2-B
#define WGFMC GPIO_PIN_6  //被检表反向无功脉冲 Timer3-A
#define YGFMC GPIO_PIN_7  //被检表反向有功脉冲 Timer3-B

//PORTM
#define WGMC GPIO_PIN_0    //被检表正向无功脉冲 Timer4-A
#define SZ_MC GPIO_PIN_1   //被检表时钟脉冲 Timer4-B
#define YGMC GPIO_PIN_2    //被检表正向有功脉冲 Timer5-A
#define GDT_MC GPIO_PIN_3  //被检表光电头脉冲 Timer5-B
#define GDT_RST GPIO_PIN_4 //光电头复位控制引脚
#define XL_MC GPIO_PIN_5   //改变* 需量周期输入
#define TQ_MC GPIO_PIN_6   //备用 改变* 时段投切脉冲
#define GOG_KZ GPIO_PIN_7  //被检表脉冲共高共低选择控制

//PORTN
#define TTAB1 GPIO_PIN_1   //双回路切换1
#define TTAB2 GPIO_PIN_0   //双回路切换2
#define WDI GPIO_PIN_3     //外置看门狗控制引脚
#define OPEN_IN GPIO_PIN_4 //续流保护继电器状态输入引脚
#define BGB_C GPIO_PIN_5   //三相续流继电器闭合控制引脚
#define GBA_C GPIO_PIN_6   //A相续流继电器断开控制引脚
#define GBB_C GPIO_PIN_7   //B相续流继电器断开控制引脚
/*TM4C_GH*/
#define I_5460A_RST GPIO_PIN_2 //电流回路5460RST
//PORTP
#define DOOR GPIO_PIN_0    //门控信号
#define BJ_SIG GPIO_PIN_1  //报警信号
#define PWM_DAC GPIO_PIN_2 //PWM模拟输出

#define U_IN_CTL GPIO_PIN_7 //电压接入控制 1 接入1号端子(默认) 0:接入3号端子 某些单相台使用 与B相电子开关控制复用
/*TM4C_GH*/
#define U_5460A_INT GPIO_PIN_2 //电压回路5460INT

//I/O口宏定义
//PORTA
#define DISP_RST_EN GPIOPinWrite(DISP_RST_GPIO, DISP_RST, 0);       //复位管脚置0
#define DISP_RST_DN GPIOPinWrite(DISP_RST_GPIO, DISP_RST, DISP_RST) //复位管脚置1

//PORTB
#define YK1NO_SIG_IN GPIOPinRead(YK1NO_GPIO, YK1NO) //遥控信号1常开(电表外置跳闸信号常开)
#define YK1NC_SIG_IN GPIOPinRead(YK1NC_GPIO, YK1NC) //遥控信号1常闭(电表外置跳闸信号常闭)
#define YK2NO_SIG_IN GPIOPinRead(YK2NO_GPIO, YK2NO) //遥控信号2常开
#define YK2NC_SIG_IN GPIOPinRead(YK2NC_GPIO, YK2NC) //遥控信号2常闭

//PORTC

//PORTD
#define U_5460A_SCLK_H GPIOPinWrite(U_5460A_SCLK_GPIO, U_5460A_SCLK, U_5460A_SCLK)
#define U_5460A_SCLK_L GPIOPinWrite(U_5460A_SCLK_GPIO, U_5460A_SCLK, 0)
#define U_5460A_CS_H GPIOPinWrite(U_5460A_CS_GPIO, U_5460A_CS, U_5460A_CS)
#define U_5460A_CS_L GPIOPinWrite(U_5460A_CS_GPIO, U_5460A_CS, 0)
#define U_5460A_SDI_H GPIOPinWrite(U_5460A_SDI_GPIO, U_5460A_SDI, U_5460A_SDI)
#define U_5460A_SDI_L GPIOPinWrite(U_5460A_SDI_GPIO, U_5460A_SDI, 0)
//PORTE
#define TZZS_LED_ON GPIOPinWrite(TZ_ZS_GPIO, TZ_ZS, TZ_ZS) //跳闸指示灯打开
#define TZZS_LED_OFF GPIOPinWrite(TZ_ZS_GPIO, TZ_ZS, 0)    //跳闸指示灯关闭
#define U_5460A_RST_H GPIOPinWrite(U_5460A_RST_GPIO, U_5460A_RST, U_5460A_RST)
#define U_5460A_RST_L GPIOPinWrite(U_5460A_RST_GPIO, U_5460A_RST, 0)
//PORTF
#define UC_ESW_OFF GPIOPinWrite(UC_ESWC_GPIO, UC_ESWC, 0)               //C相电压电子开关断开
#define UC_ESW_ON GPIOPinWrite(UC_ESWC_GPIO, UC_ESWC, UC_ESWC)          //C相电压电子开关接入
#define UB_ESW_OFF GPIOPinWrite(UB_ESWC_GPIO, UB_ESWC, 0)               //B相电压电子开关断开
#define UB_ESW_ON GPIOPinWrite(UB_ESWC_GPIO, UB_ESWC, UB_ESWC)          //B相电压电子开关接入
#define UA_ESW_OFF GPIOPinWrite(UA_ESWC_GPIO, UA_ESWC, 0)               //A相电压电子开关断开
#define UA_ESW_ON GPIOPinWrite(UA_ESWC_GPIO, UA_ESWC, UA_ESWC)          //A相电压电子开关接入
#define ICJDQ_OPEN GPIOPinWrite(GBC_C_GPIO, GBC_C, GBC_C)               //C相续流继电器断开控制
#define ICJDQ_OPEN_CANCEL GPIOPinWrite(GBC_C_GPIO, GBC_C, 0)            //C相续流继电器断开控制撤销
#define TEST_LAMP_ON GPIOPinWrite(TEST_LAMP_GPIO, TEST_LAMP, TEST_LAMP) //校验指示灯亮
#define TEST_LAMP_OFF GPIOPinWrite(TEST_LAMP_GPIO, TEST_LAMP, 0)        //校验指示灯灭
#define UC_JDQ_ON GPIOPinWrite(UC_JC_GPIO, UC_JC, 0)                    //C相电压继电器接入
#define UC_JDQ_OFF GPIOPinWrite(UC_JC_GPIO, UC_JC, UC_JC)               //C相电压继电器断开
#define UB_JDQ_ON GPIOPinWrite(UB_JC_GPIO, UB_JC, 0)                    //B相电压继电器接入
#define UB_JDQ_OFF GPIOPinWrite(UB_JC_GPIO, UB_JC, UB_JC)               //B相电压继电器断开
#define UA_JDQ_ON GPIOPinWrite(UA_JC_GPIO, UA_JC, 0)                    //A相电压继电器接入
#define UA_JDQ_OFF GPIOPinWrite(UA_JC_GPIO, UA_JC, UA_JC)               //A相电压继电器断开
//PORTG
#define MC_OUT1_LOW GPIOPinWrite(MC_OUT1_GPIO, MC_OUT1, 0)                                       //脉冲信号1输出低
#define MC_OUT1_HIGH GPIOPinWrite(MC_OUT1_GPIO, MC_OUT1, MC_OUT1)                                //脉冲信号1输出高
#define MC_OUT2_LOW GPIOPinWrite(MC_OUT2_GPIO, MC_OUT2, 0)                                       //脉冲信号2输出低
#define MC_OUT2_HIGH GPIOPinWrite(MC_OUT2_GPIO, MC_OUT2, MC_OUT2)                                //脉冲信号2输出高
#define MC_OUT3_LOW GPIOPinWrite(MC_OUT3_GPIO, MC_OUT3, 0)                                       //脉冲信号3输出低
#define MC_OUT3_HIGH GPIOPinWrite(MC_OUT3_GPIO, MC_OUT3, MC_OUT3)                                //脉冲信号3输出高
#define MC_OUT4_LOW GPIOPinWrite(MC_OUT4_GPIO, MC_OUT4, 0)                                       //脉冲信号4输出低
#define MC_OUT4_HIGH GPIOPinWrite(MC_OUT4_GPIO, MC_OUT4, MC_OUT4)                                //脉冲信号4输出高
#define MC_OUT5_LOW GPIOPinWrite(MC_OUT5_GPIO, MC_OUT5, 0)                                       //脉冲信号5输出低
#define MC_OUT5_HIGH GPIOPinWrite(MC_OUT5_GPIO, MC_OUT5, MC_OUT5)                                //脉冲信号5输出高
#define MC_OUT6_LOW GPIOPinWrite(MC_OUT6_GPIO, MC_OUT6, 0)                                       //脉冲信号6输出低
#define MC_OUT6_HIGH GPIOPinWrite(MC_OUT6_GPIO, MC_OUT6, MC_OUT6)                                //脉冲信号6输出高
#define MC_OUT7_LOW GPIOPinWrite(MC_OUT7_GPIO, MC_OUT7, 0)                                       //脉冲信号7输出低
#define MC_OUT7_HIGH GPIOPinWrite(MC_OUT7_GPIO, MC_OUT7, MC_OUT7)                                //脉冲信号7输出高
#define MC_OUT8_LOW GPIOPinWrite(MC_OUT8_GPIO, MC_OUT8, 0)                                       //脉冲信号8输出低
#define MC_OUT8_HIGH GPIOPinWrite(MC_OUT8_GPIO, MC_OUT8, MC_OUT8)                                //脉冲信号8输出高
#define MC_OUT1_Reverse GPIOPinWrite(MC_OUT1_GPIO, MC_OUT1, ~GPIOPinRead(MC_OUT1_GPIO, MC_OUT1)) //脉冲信号1反转
#define MC_OUT2_Reverse GPIOPinWrite(MC_OUT2_GPIO, MC_OUT2, ~GPIOPinRead(MC_OUT2_GPIO, MC_OUT2)) //脉冲信号2反转
#define MC_OUT3_Reverse GPIOPinWrite(MC_OUT3_GPIO, MC_OUT3, ~GPIOPinRead(MC_OUT3_GPIO, MC_OUT3)) //脉冲信号3反转
#define MC_OUT4_Reverse GPIOPinWrite(MC_OUT4_GPIO, MC_OUT4, ~GPIOPinRead(MC_OUT4_GPIO, MC_OUT4)) //脉冲信号4反转
#define MC_OUT5_Reverse GPIOPinWrite(MC_OUT5_GPIO, MC_OUT5, ~GPIOPinRead(MC_OUT5_GPIO, MC_OUT5)) //脉冲信号5反转
#define MC_OUT6_Reverse GPIOPinWrite(MC_OUT6_GPIO, MC_OUT6, ~GPIOPinRead(MC_OUT6_GPIO, MC_OUT6)) //脉冲信号6反转
#define MC_OUT7_Reverse GPIOPinWrite(MC_OUT7_GPIO, MC_OUT7, ~GPIOPinRead(MC_OUT7_GPIO, MC_OUT7)) //脉冲信号7反转
#define MC_OUT8_Reverse GPIOPinWrite(MC_OUT8_GPIO, MC_OUT8, ~GPIOPinRead(MC_OUT8_GPIO, MC_OUT8)) //脉冲信号8反转
//PORTH
#define ABBA_HIGH GPIOPinWrite(ABBA_GPIO, ABBA, ABBA) //默认RS485极性
#define ABBA_LOW GPIOPinWrite(ABBA_GPIO, ABBA, 0)     //翻转RS485极性
#define I_5460A_SCLK_H GPIOPinWrite(I_5460A_SCLK_GPIO, I_5460A_SCLK, I_5460A_SCLK)
#define I_5460A_SCLK_L GPIOPinWrite(I_5460A_SCLK_GPIO, I_5460A_SCLK, 0)
#define I_5460A_CS_H GPIOPinWrite(I_5460A_CS_GPIO, I_5460A_CS, I_5460A_CS)
#define I_5460A_CS_L GPIOPinWrite(I_5460A_CS_GPIO, I_5460A_CS, 0)
#define I_5460A_SDI_H GPIOPinWrite(I_5460A_SDI_GPIO, I_5460A_SDI, I_5460A_SDI)
#define I_5460A_SDI_L GPIOPinWrite(I_5460A_SDI_GPIO, I_5460A_SDI, 0)
//PORTJ
#define YX_CTL1_LOW GPIOPinWrite(YX_CTL1_GPIO, YX_CTL1, 0)
#define MMMMMMMMMM mmmmmmmmm                                                                     //不加此行后面部分代码不按颜色主题显示（VSCODE中）                                      //遥信信号1输出低
#define YX_CTL1_HIGH GPIOPinWrite(YX_CTL1_GPIO, YX_CTL1, YX_CTL1)                                //遥信信号1输出高
#define YX_CTL2_LOW GPIOPinWrite(YX_CTL2_GPIO, YX_CTL2, 0)                                       //遥信信号2输出低
#define YX_CTL2_HIGH GPIOPinWrite(YX_CTL2_GPIO, YX_CTL2, YX_CTL2)                                //遥信信号2输出高
#define YX_CTL3_LOW GPIOPinWrite(YX_CTL3_GPIO, YX_CTL3, 0)                                       //遥信信号3输出低
#define YX_CTL3_HIGH GPIOPinWrite(YX_CTL3_GPIO, YX_CTL3, YX_CTL3)                                //遥信信号3输出高
#define YX_CTL4_LOW GPIOPinWrite(YX_CTL4_GPIO, YX_CTL4, 0)                                       //遥信信号4输出低
#define YX_CTL4_HIGH GPIOPinWrite(YX_CTL4_GPIO, YX_CTL4, YX_CTL4)                                //遥信信号4输出高
#define YX_CTL1_Reverse GPIOPinWrite(YX_CTL1_GPIO, YX_CTL1, ~GPIOPinRead(YX_CTL1_GPIO, YX_CTL1)) //遥信信号1反转
#define YX_CTL2_Reverse GPIOPinWrite(YX_CTL2_GPIO, YX_CTL2, ~GPIOPinRead(YX_CTL2_GPIO, YX_CTL2)) //遥信信号2反转
#define YX_CTL3_Reverse GPIOPinWrite(YX_CTL3_GPIO, YX_CTL3, ~GPIOPinRead(YX_CTL3_GPIO, YX_CTL3)) //遥信信号3反转
#define YX_CTL4_Reverse GPIOPinWrite(YX_CTL4_GPIO, YX_CTL4, ~GPIOPinRead(YX_CTL4_GPIO, YX_CTL4)) //遥信信号4反转
#define NO_SELT3_H GPIOPinWrite(NO_SELT3_GPIO, NO_SELT3, NO_SELT3)
#define NO_SELT3_L GPIOPinWrite(NO_SELT3_GPIO, NO_SELT3, 0)
#define P3P4SELOUT3_H GPIOPinWrite(P3P4SELOUT3_GPIO, P3P4SELOUT3, P3P4SELOUT3)
#define P3P4SELOUT3_L GPIOPinWrite(P3P4SELOUT3_GPIO, P3P4SELOUT3, 0)
#define NO_SELT2_H GPIOPinWrite(NO_SELT2_GPIO, NO_SELT2, NO_SELT2)
#define NO_SELT2_L GPIOPinWrite(NO_SELT2_GPIO, NO_SELT2, 0)
#define P3P4SELOUT2_H GPIOPinWrite(P3P4SELOUT2_GPIO, P3P4SELOUT2, P3P4SELOUT2)
#define P3P4SELOUT2_L GPIOPinWrite(P3P4SELOUT2_GPIO, P3P4SELOUT2, 0)
#define NO_SELT1_H GPIOPinWrite(NO_SELT1_GPIO, NO_SELT31 NO_SELT1)
#define NO_SELT1_L GPIOPinWrite(NO_SELT1_GPIO, NO_SELT1, 0)
#define P3P4SELOUT1_H GPIOPinWrite(P3P4SELOUT1_GPIO, P3P4SELOUT1, P3P4SELOUT1)
#define P3P4SELOUT1_L GPIOPinWrite(P3P4SELOUT1_GPIO, P3P4SELOUT1, 0)
#define K2_H GPIOPINWRITE(K2_GPIO, K2, K2)
#define K2_L GPIOPINWRITE(K2_GPIO, K2, 0)
#define K1_H GPIOPINWRITE(K1_GPIO, K1, K1)
#define K1_L GPIOPINWRITE(K1_GPIO, K1, 0)
//PORTK
#define YK3NO_SIG_IN GPIOPinRead(YK3NO_GPIO, YK3NO) //遥控信号3常开
#define YK3NC_SIG_IN GPIOPinRead(YK3NC_GPIO, YK3NC) //遥控信号3常闭
#define YK4NO_SIG_IN GPIOPinRead(YK4NO_GPIO, YK4NO) //遥控信号4常开
#define YK4NC_SIG_IN GPIOPinRead(YK4NC_GPIO, YK4NC) //遥控信号4常闭
//PORTM
#define GDT_RST_EN GPIOPinWrite(GDT_RST_GPIO, GDT_RST, GDT_RST) //光电头复位使能 高电平使能
#define GDT_RST_DN GPIOPinWrite(GDT_RST_GPIO, GDT_RST, 0)       //光电头复位禁能 低电平禁能
#define DOWN_JOIN GPIOPinWrite(GOG_KZ_GPIO, GOG_KZ, GOG_KZ)     //共低端 发射极连在一起 E
#define UP_JOIN GPIOPinWrite(GOG_KZ_GPIO, GOG_KZ, 0)            //共高端 集电极连在一起 C
#define DZMC_IN GPIOPinRead(DZ_MC_GPIO, DZ_MC)                  //电子脉冲数据输入
#define SZMC_IN GPIOPinRead(SZ_MC_GPIO, SZ_MC)                  //时钟脉冲数据输入
#define GDTMC_IN GPIOPinRead(GDT_MC_GPIO, GDT_MC)               //光电头脉冲数据输入
//PORTN
#define I_5460A_RST_H GPIOPinWrite(I_5460A_RST_GPIO, I_5460A_RST, I_5460A_RST)
#define I_5460A_RST_L GPIOPinWrite(I_5460A_RST_GPIO, I_5460A_RST, 0)
#define TTAB1JDQ_CLOSE GPIOPinWrite(TTAB1_GPIO, TTAB1, TTAB1) //电流回路1继电器接入
#define TTAB1JDQ_CANCEL GPIOPinWrite(TTAB1_GPIO, TTAB1, 0)    //电流回路1继电器撤销
#define TTAB2JDQ_CLOSE GPIOPinWrite(TTAB2_GPIO, TTAB2, TTAB2) //电流回路2继电器接入
#define TTAB2JDQ_CANCEL GPIOPinWrite(TTAB2_GPIO, TTAB2, 0)    //电流回路2继电器撤销
#define WDI_HIGH GPIOPinWrite(WDI_GPIO, WDI, WDI)             //输出 外部看门狗复位
#define WDI_LOW GPIOPinWrite(WDI_GPIO, WDI, 0)                //输出
#define IJDQ_CLOSE GPIOPinWrite(BGB_C_GPIO, BGB_C, BGB_C)     //续流继电器闭合控制
#define IJDQ_CLOSE_CANCEL GPIOPinWrite(BGB_C_GPIO, BGB_C, 0)  //续流继电器闭合控制撤销
#define IAJDQ_OPEN GPIOPinWrite(GBA_C_GPIO, GBA_C, GBA_C)     //A相续流继电器断开控制
#define IAJDQ_OPEN_CANCEL GPIOPinWrite(GBA_C_GPIO, GBA_C, 0)  //A相续流继电器断开控制撤销
#define IBJDQ_OPEN GPIOPinWrite(GBB_C_GPIO, GBB_C, GBB_C)     //B相续流继电器断开控制
#define I_5460A_RST_H GPIOPinWrite(I_5460A_RST_GPIO, I_5460A_RST, I_5460A_RST)
#define I_5460A_RST_L GPIOPinWrite(I_5460A_RST_GPIO, I_5460A_RST, 0)
//PORTP
#define DOOR_SIG_OPEN GPIOPinWrite(DOOR_GPIO, DOOR, DOOR) //门控信号开
#define DOOR_SIG_CLOSE GPIOPinWrite(DOOR_GPIO, DOOR, 0)   //门控信号闭
#define BJ_SIG_IN GPIOPinRead(BJ_SIG_GPIO, BJ_SIG)        //表报警信号输入
//CAN缓冲区长度定义
#define CAN_SDILEN 50 //CAN短数据接收缓冲区长度	每个结构体长16字节 8字节有效数据
#define CAN_SDOLEN 50 //CAN短数据发送缓冲区长度	每个结构体长16字节 8字节有效数据

#define CAN_LDILEN 20 //CAN长数据接收缓冲区长度	每个结构体长16字节 8字节有效数据
#define CAN_LDOLEN 10 //CAN长数据发送缓冲区长度	每个结构体长16字节 8字节有效数据

