feijie825/TM4C-gonghao/user_h/define.h
//多功能表
#define MTRCOM_ILEN 2048 //COM0接收缓冲区长度
#define MTRCOM_OLEN 1024 //COM0发送缓冲区长度
#define LCTCOM_ILEN 2048 //COM1接收缓冲区长度
#define LCTCOM_OLEN 1024 //COM1发送缓冲区长度
#define RTECOM_ILEN 2048 //COM3接收缓冲区长度
#define RTECOM_OLEN 1024 //COM3发送缓冲区长度
#define ATECOM_ILEN 2048 //COM5接收缓冲区长度
#define ATECOM_OLEN 1024 //COM5发送缓冲区长度
#define IRECOM_ILEN 2048 //COM6接收缓冲区长度
#define IRECOM_OLEN 1024 //COM6发送缓冲区长度

//CAN 波特率设置 与CANBitClkSettings[]中对应
#define CANBAUD_100K 100000
#define CANBAUD_125K 125000
#define CANBAUD_250K 250000
#define CANBAUD_500K 500000
#define CANBAUD_1M 1000000
#define CANBAUD CANBAUD_500K
//误差单元短CAN帧指令分块 每256个命令为一组
#define ERR_CMD_ID 0 //误差计算单元原有命令 CAN 命令编号(0x004~0x103)
#define CLK_CMD_ID 1 //时钟校验仪命令       CAN 命令编号(0x104~0x203)
#define LCT_CMD_ID 2 //负控终端指令         CAN 命令编号(0x204~0x303)
//MTR_MOD被检设备类型定义
#define Acquire_Terminal_13 '0' //专变终端Ⅲ型(2013版)标识
#define Reading_Terminal_13 '1' //集中器Ⅰ型(2013版)标识
#define Smart_Meter '2'         //智能电表
#define Acquire_Terminal_09 '3' //专变终端Ⅲ型(2009版)标识
#define Reading_Terminal_09 '4' //集中器Ⅰ型(2009版)标识
//原误差板命令								   //0 1 2 3  预留给长数据处理
#define ERR_ICMD_GD (ERR_CMD_ID * 0x100 + 4) //接收标准值     XX 表号 XXXX 数据 0---3为长数据命令
#define ERR_ICMD_GE (ERR_ICMD_GD + 1)        //接收校验圈数
#define ERR_ICMD_GF (ERR_ICMD_GE + 1)        //接收误差清零
#define ERR_ICMD_GG (ERR_ICMD_GF + 1)        //接收光电头对光
#define ERR_ICMD_GH (ERR_ICMD_GG + 1)        //选表位 挂表选择
#define ERR_ICMD_GI (ERR_ICMD_GH + 1)        //对黑斑         ;0退去其他试验，回到校验状态
#define ERR_ICMD_GJ (ERR_ICMD_GI + 1)        //监视光电头脉冲 ;1起动/潜动时记数 0退去其他试验，回到校验状态
#define ERR_ICMD_GK (ERR_ICMD_GJ + 1)        //接收当前脉冲象限
#define ERR_ICMD_GL (ERR_ICMD_GK + 1)        //喇叭开关
#define ERR_ICMD_GM (ERR_ICMD_GL + 1)        //准备开始走字试验
#define ERR_ICMD_GN (ERR_ICMD_GM + 1)        //开始进行走字试验
#define ERR_ICMD_GO (ERR_ICMD_GN + 1)        //接收被校表常数
#define ERR_ICMD_GP (ERR_ICMD_GO + 1)        //脉冲选择  电子脉冲还是光电头脉冲
#define ERR_ICMD_GQ (ERR_ICMD_GP + 1)        //计电能试验      1:开始  0:终止
#define ERR_ICMD_GR (ERR_ICMD_GQ + 1)        //清除电能计数
#define ERR_ICMD_GS (ERR_ICMD_GR + 1)        //脉冲比较  电子脉冲和光电头脉冲比较
#define ERR_ICMD_GT (ERR_ICMD_GS + 1)        //接收脉冲和盘转比值
#define ERR_ICMD_GU (ERR_ICMD_GT + 1)        //接收脉冲和盘转设定比较圈数
#define ERR_ICMD_GV (ERR_ICMD_GU + 1)        //进入失压状态,接收失压方案
#define ERR_ICMD_GW (ERR_ICMD_GV + 1)        //失压试验开始
#define ERR_ICMD_GX (ERR_ICMD_GW + 1)        //功耗试验或控制时钟脉冲和需量周期脉冲转换
#define ERR_ICMD_GY (ERR_ICMD_GX + 1)        //送分频系数
#define ERR_ICMD_GZ (ERR_ICMD_GY + 1)        //计读脉冲法常数测试试验
#define ERR_ICMD_Gd (ERR_ICMD_GZ + 1)        //功耗测试 表位和相别选择
#define ERR_ICMD_Ge (ERR_ICMD_Gd + 1)        //功耗测试仪 电压线圈有功修正值
#define ERR_ICMD_Gf (ERR_ICMD_Ge + 1)        //电压线圈视在功率修正值
#define ERR_ICMD_Gg (ERR_ICMD_Gf + 1)        //接收电流线圈视在功率修正值
#define ERR_ICMD_Gh (ERR_ICMD_Gg + 1)        //设置功耗测量单元单元号
#define ERR_ICMD_Gi (ERR_ICMD_Gh + 1)        //脉冲波形测试
#define ERR_ICMD_Gj (ERR_ICMD_Gi + 1)        //接收接线方式
#define ERR_ICMD_Gk (ERR_ICMD_Gj + 1)        //4059被校表脉冲输出类型选择
#define ERR_ICMD_Gl (ERR_ICMD_Gk + 1)        //设置走字脉冲数
#define ERR_ICMD_Gm (ERR_ICMD_Gl + 1)        //脉冲走字试验
#define ERR_ICMD_Gn (ERR_ICMD_Gm + 1)        //预置脉冲数
//误差单元接收命令(多功能走字耐压台通讯命令)
#define ERR_ICMD_Go (ERR_ICMD_Gn + 1)           //开始耐压试验
#define ERR_ICMD_Gp (ERR_ICMD_Go + 1)           //耐压时间到
#define ERR_ICMD_Gq (ERR_ICMD_Gp + 1)           //切换表尾电压端子
#define ERR_ICMD_Gr (ERR_ICMD_Gq + 1)           //误差校验指示灯控制命令
#define ERR_ICMD_Gs (ERR_ICMD_Gr + 1)           //继电器吸合
#define ERR_ICMD_Gt (ERR_ICMD_Gs + 1)           //继电器断开
#define ERR_ICMD_Gu (ERR_ICMD_Gt + 1)           //电流回路开路检测
#define ERR_ICMD_SYPH (ERR_ICMD_Gu + 1)         //电压跌落相别
#define ERR_ICMD_MIN_CST (ERR_ICMD_SYPH + 1)    //最小电表常数
#define ERR_ICMD_ZZDS (ERR_ICMD_MIN_CST + 1)    //接收校核常数度数
#define ERR_ICMD_MCHC (ERR_ICMD_ZZDS + 1)       //接收脉冲合成方式
#define ERR_ICMD_SYFAN (ERR_ICMD_MCHC + 1)      //接收失压方案
#define ERR_ICMD_MFCLKMD (ERR_ICMD_SYFAN + 1)   //设置多功能脉冲方式  共用还是分开
#define ERR_ICMD_MFCLKTY (ERR_ICMD_MFCLKMD + 1) //当前多功能脉冲类型  时钟脉冲 需量脉冲 投切脉冲 ...
#define ERR_ICMD_ELEPLS (ERR_ICMD_MFCLKTY + 1)  //设置电子脉冲输入 调试用 PA PR QA QR '1' '2' '3' '4'
#define ERR_ICMD_IJDQR (ERR_ICMD_ELEPLS + 1)    //电流旁路继电器复位
#define ERR_ICMD_LEDTST (ERR_ICMD_IJDQR + 1)    //测试命令显示8.8.8.8.8.8.8.8.
#define ERR_ICMD_RSTLED (ERR_ICMD_LEDTST + 1)   //复位7279
#define ERR_ICMD_TZEN (ERR_ICMD_RSTLED + 1)     //合闸检测使能命令
#define ERR_ICMD_MBJEN (ERR_ICMD_TZEN + 1)      //表报警信号检测使能
#define ERR_ICMD_TS (ERR_ICMD_MBJEN + 1)        //单三相台发送命令
#define ERR_ICMD_DXTZ (ERR_ICMD_TS + 1)         //设置单相跳闸
#define ERR_ICMD_START (ERR_ICMD_DXTZ + 1)      //总控中心启动命令
#define ERR_ICMD_SETCK (ERR_ICMD_START + 1)     //设置插卡
#define ERR_ICMD_UCLOP (ERR_ICMD_SETCK + 1)     //设置表位电压接入 断开
#define ERR_ICMD_ZBTST (ERR_ICMD_UCLOP + 1)     //载表试验
#define ERR_ICMD_LIGHT (ERR_ICMD_ZBTST + 1)     //误差板状态指示灯控制
#define ERR_ICMD_SLEDN (ERR_ICMD_LIGHT + 1)     //设置误差板LED数码管显示位数
#define ERR_ICMD_VSET (ERR_ICMD_SLEDN + 1)      //设置载波虚拟表电压接入相别
#define ERR_ICMD_COM0SEL (ERR_ICMD_VSET + 1)    //设置接入UART0的通讯方式
#define ERR_ICMD_COM1SEL (ERR_ICMD_COM0SEL + 1) //设置接入UART1的通讯方式
#define ERR_ICMD_ZBLBIN (ERR_ICMD_COM1SEL + 1)  //载波滤波电路接入选择
#define ERR_ICMD_YXCTL (ERR_ICMD_ZBLBIN + 1)    //遥信信号控制命令
#define ERR_ICMD_DOORCTL (ERR_ICMD_YXCTL + 1)   //门控信号控制命令
#define ERR_ICMD_EQPMOD (ERR_ICMD_DOORCTL + 1)  //检测设备类型设置
#define ERR_ICMD_PULSET (ERR_ICMD_EQPMOD + 1)   //脉冲参数设置命令(针对专变终端)
#define ERR_ICMD_PULRUN (ERR_ICMD_PULSET + 1)   //脉冲输出设置命令(针对专变终端)
#define ERR_ICMD_YKSET (ERR_ICMD_PULRUN + 1)    //终端遥控信号设置
#define ERR_ICMD_YKPULSE (ERR_ICMD_YKSET + 1)   //设置遥控信号脉冲触发方式
#define ERR_ICMD_NPRS485 (ERR_ICMD_YKPULSE + 1) //测试无极性RS485
#define ERR_ICMD_MTYPE (ERR_ICMD_NPRS485 + 1)   //表类型 国网表 'N'  南网表'S'
#define ERR_ICMD_ADCONV (ERR_ICMD_MTYPE + 1)    //12V直流电AD转换控制
#define ERR_ICMD_ULVL (ERR_ICMD_ADCONV + 1)     //设置电压选择70%or100%
#define ERR_ICMD_WZTZCTL (ERR_ICMD_ULVL + 1)    //外置跳闸信号端子继电器控制‘O’断开‘C’闭合
#define ERR_ICMD_TTAB (ERR_ICMD_WZTZCTL + 1)    //单相装置电流双回路切换
#define ERR_ICMD_MEAPN (ERR_ICMD_TTAB + 1)      //并行功耗测试控制
#define ERR_ICMD_CHKP (ERR_ICMD_MEAPN + 1)      //并行功耗各项数据查询
//误差单元接收命令(时钟校验仪部分命令)
#define ERR_ICMD_MBAUD (CLK_CMD_ID * 0x100 + 4) //设置多功能表(模拟表)串口通信参数
#define ERR_ICMD_LBAUD (ERR_ICMD_MBAUD + 1)     //设置负控终端串口通信参数
#define ERR_ICMD_CLKFRQ (ERR_ICMD_LBAUD + 1)    //设置各表位时钟频率
#define ERR_ICMD_CLKTIM (ERR_ICMD_CLKFRQ + 1)   //设置该表位时钟频率测量时间
#define ERR_ICMD_CLKCTL (ERR_ICMD_CLKTIM + 1)   //时钟频率测量控制
#define ERR_ICMD_XULCTL (ERR_ICMD_CLKCTL + 1)   //需量周期测量控制
#define ERR_ICMD_XULPLS (ERR_ICMD_XULCTL + 1)   //设置需量周期测量个数
#define ERR_ICMD_EDIS (ERR_ICMD_XULPLS + 1)     //设置显示方式
#define ERR_ICMD_RLMDT (ERR_ICMD_EDIS + 1)      //重新装载模拟表数据     上位机   -> 模拟表
#define ERR_ICMD_RLLDT (ERR_ICMD_RLMDT + 1)     //重新装载负控终端数据   上位机   -> 负控终端
#define ERR_ICMD_RTMDT (ERR_ICMD_RLLDT + 1)     //重发收到的模拟表数据   模拟表   -> 上位机
#define ERR_ICMD_RTLDT (ERR_ICMD_RTMDT + 1)     //重发收到的负控终端数据 负控终端 -> 上位机
#define ERR_ICMD_SEC (ERR_ICMD_RTLDT + 1)       //时间基准 秒信号
#define ERR_ICMD_RED485 (ERR_ICMD_SEC + 1)      //设置RS485第二通道 '1' 接表485第二通道 '2' 接表红外
#define ERR_ICMD_READ_VER (ERR_ICMD_RED485 + 1) //读版本号命令
#define ERR_ICMD_RSTS (ERR_ICMD_READ_VER + 1)   //读小显示工作状态
#define ERR_ICMD_SMTR (ERR_ICMD_RSTS + 1)       //设置监视仪表标准表 兼容协议 被检表误差板未用
#define ERR_ICMD_RBAUD (ERR_ICMD_SMTR + 1)      //RTECOM串口通信参数
#define ERR_ICMD_ABAUD (ERR_ICMD_RBAUD + 1)     //ATECOM串口通信参数
#define ERR_ICMD_IBAUD (ERR_ICMD_ABAUD + 1)     //IRECOM串口通信参数
//负控终端命令 LCT_CMD_ID*0x100+4
#define TX_MTR_DATA (LCT_CMD_ID * 0x100 + 4) //发送模拟表数据到负控终端
#define TX_LCT_DATA (TX_MTR_DATA + 1)        //发送数据到负控终端

//保留命令
#define JTAG_EN 0x7DF //2015 最后一个命令
//回送原误差板数据命令
#define ERR_OCMD_CB (ERR_CMD_ID * 0x100 + 4) //  XXXXXX(0DH)  回送被校表脉冲数(累加值)
#define ERR_OCMD_CC (ERR_OCMD_CB + 1)        //  X(0DH)       起动、潜动试验时圈数
#define ERR_OCMD_CE (ERR_OCMD_CC + 1)        //  ±XXXX(0DH)   误差
#define ERR_OCMD_CF (ERR_OCMD_CE + 1)        //  ±XXX(0DH)    盘转误差圈数
#define ERR_OCMD_CG (ERR_OCMD_CF + 1)        //  X(0DH)       X:0未挂表X:1 挂表
#define ERR_OCMD_CH (ERR_OCMD_CG + 1)        //  :XXX(0DH)    湿度
#define ERR_OCMD_CI (ERR_OCMD_CH + 1)        //  ±XXXX(0DH)   XXXX误差
#define ERR_OCMD_CK (ERR_OCMD_CI + 1)        //  1(0DH)       累积脉冲试验停止
#define ERR_OCMD_CM (ERR_OCMD_CK + 1)        //  XXXXXX,XXXXXX(0DH) 送出被校表脉冲周期, 占空比
                                             //  前面的数据是：被校表脉冲高电平占用时间
                                             //  后面的数据是：被校表脉冲低电平占用时间
#define ERR_OCMD_CN (ERR_OCMD_CM + 1)        //  XX(0DH)      XX当前圈数
#define ERR_OCMD_CP (ERR_OCMD_CN + 1)        //  XXXXXX(0DH)  XXX.XXX被校表电能
#define ERR_OCMD_CS (ERR_OCMD_CP + 1)        //  X(0DH)       X:0,未对好斑,X:1斑已对好
#define ERR_OCMD_CT (ERR_OCMD_CS + 1)        //  :XXX(0DH)    温度
#define ERR_OCMD_CV (ERR_OCMD_CT + 1)        //  X（0DH）     X=0：未知 X=1：开路X=2：不开路
#define ERR_OCMD_CW (ERR_OCMD_CV + 1)        //  :XXXXXX,XXXXXXX,XXXXXX   功耗测试数据
#define ERR_OCMD_CX (ERR_OCMD_CW + 1)        //  X(0DH)       耐压结果
#define ERR_OCMD_CY (ERR_OCMD_CX + 1)        //  X(0DH)       回送失压试验接收脉冲个数
#define ERR_OCMD_CZ (ERR_OCMD_CY + 1)        //  X(0DH)       X=0: 走字试验开始,X=1: 走字试验结束

//回送时钟数据命令
#define ERR_OCMD_CLK_FRQ (CLK_CMD_ID * 0x100 + 4) //  回送被检表时钟频率
#define ERR_OCMD_DAY_ERR (ERR_OCMD_CLK_FRQ + 1)   //  回送日计时误差
#define ERR_OCMD_XULZQ (ERR_OCMD_DAY_ERR + 1)     //  回送需量周期
#define ERR_OCMD_TQMC (ERR_OCMD_XULZQ + 1)        //  收到时段投切脉冲
#define ERR_OCMD_NZTZ (ERR_OCMD_TQMC + 1)         //  内置跳闸信号状态
#define ERR_OCMD_WZTZ (ERR_OCMD_NZTZ + 1)         //  外置跳闸信号状态
#define ERR_OCMD_JDQGZ (ERR_OCMD_WZTZ + 1)        //  续流继电器故障状态
#define ERR_OCMD_MBJ (ERR_OCMD_JDQGZ + 1)         //  表报警输出状态
#define ERR_OCMD_VER (ERR_OCMD_MBJ + 1)           //  回送误差板版本号
#define ERR_OCMD_STS (ERR_OCMD_VER + 1)           //  回送误差板工作状态
#define ERR_OCMD_BERR (ERR_OCMD_STS + 1)          //  回送标准表误差(给副标准表 误差计算预留)
#define ERR_OCMD_DZPLS (ERR_OCMD_BERR + 1)        //  检测到电子脉冲
#define ERR_OCMD_GDPLS (ERR_OCMD_DZPLS + 1)       //  检测到光电脉冲
#define ERR_OCMD_SZPLS (ERR_OCMD_GDPLS + 1)       //  检测到时钟脉冲
#define ERR_OCMD_MTRDY (ERR_OCMD_SZPLS + 1)       //  有无表回送命令
#define ERR_OCMD_LUNCI1 (ERR_OCMD_MTRDY + 1)      //  轮次1控制状态回送名令
#define ERR_OCMD_LUNCI2 (ERR_OCMD_LUNCI1 + 1)     //  轮次2控制状态回送名令
#define ERR_OCMD_LUNCI3 (ERR_OCMD_LUNCI2 + 1)     //  轮次3控制状态回送名令
#define ERR_OCMD_LUNCI4 (ERR_OCMD_LUNCI3 + 1)     //  轮次4控制状态回送名令
#define ERR_OCMD_ADCONV (ERR_OCMD_LUNCI4 + 1)     //  直流12VAD转换结果上传
//定义AD采样超时时间
#define AD_OVER_TIME 100  //单位:1ms  100ms 正常125k 64次平均512us
#define AD_TRIG_TIME 1000 //1秒采样1次
